tap "homebrew/bundle"
brew "cmake"
brew "docker"
brew "fzf"
brew "gh"
brew "python@3.13"
brew "pipenv"
brew "pyenv"
brew "zsh-autosuggestions"
cask "bitwarden"
cask "github"
cask "google-chrome"
cask "iterm2"
cask "visual-studio-code"
vscode "aaron-bond.better-comments"
vscode "christian-kohler.path-intellisense"
vscode "daylerees.rainglow"
vscode "dbaeumer.vscode-eslint"
vscode "devth.owlth"
vscode "dustypomerleau.rust-syntax"
vscode "ecmel.vscode-html-css"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "evgeniypeshkov.syntax-highlighter"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.codespaces"
vscode "humao.rest-client"
vscode "james-yu.latex-workshop"
vscode "kleber-swf.unity-code-snippets"
vscode "luxcium.pop-n-lock-theme-vscode"
vscode "max-ss.cyberpunk"
vscode "mgmcdermott.vscode-language-babel"
vscode "modular-mojotools.vscode-mojo"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.theme-markdownkit"
vscode "msjsdiag.vscode-react-native"
vscode "nimda.deepdark-material"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "prisma.prisma"
vscode "profimedica.live-preview"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sidthesloth.html5-boilerplate"
vscode "slevesque.shader"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "xabikos.javascriptsnippets"
vscode "xabikos.reactsnippets"
